* WRITE TO OPERATOR EXAMPLE *
* PART 1 OF 2-OTHER FILE IS CCNGWT2 *
WTO CSECT
WTO AMODE 31
WTO RMODE ANY
********
* R1->ADDRESS OF INTEGER -> LENGTH OF STRING
* ->CHARACTER STRING
*       DC  C'BAD '
OK       EDCPRLG DSALEN=DLEN
         USING DSA,13
********
* RANGE CHECK LENGTH
* IGNORE A SINGLE TRAILING NULL CHARACTER
        L 5,0(,1) POINT TO LENGTH
        LA 15,4 RETURN CODE FOR INVALID LENGTH
        ICM 5,B'1111',0(5) LENGTH OF MESSAGE
        BNP RETURN NOT >0? RETURN
        L 6,4(,1) POINT TO MESSAGE
        LR   9,6
        LA 8,0(5,6) POINT TO CHAR AFTER MESSAGE
        BCTR 8,0 POINT TO LAST CHARACTER
        CLI 0(8),0 IS IT A NULL CHARACTER?
        BNE NOENDINGNULL
        BCT 5,NOENDINGNULL IGNORE IT: USER SAID WTO(SIZEOF S,S)
        B RETURN UNLESS LENGTH WAS DROPPED TO ZERO
NOENDINGNULL DS 0H
        LA 7,0 LENGTH OK SO FAR
        LA 8,L'BUFFER MAXIMUM LENGTH
        CR 5,8 CHECK LENGTH
        BNH LENOK
        LR 5,8 SHOW ONLY WHAT FITS INTO BUFFER
        LA 7,4 REMEMBER SPECIFIED STRING WAS TOO LONG
LENOK DS 0H
********
* BUILD WTO BUFFER
        STH 5,PREFIX LENGTH SHOWN GOES INTO PREFIX
        BCTR 5,0 REDUCE LENGTH FOR EXECUTE
        EX 5,MSG MOVE MESSAGE TEXT
        LA 6,PREFIX POINT TO PREFIX OF COPIED MESSAGE
        MVC WTOD,WTOL MOVE LIST FORM OF MACRO TO DSA
        WTO TEXT=(6),MF=(E,WTOD)
********
* IF WTO RETURNED NON-ZERO THATS THE RETURN CODE FOR THE USER
* OTHERWISE WE RETURN 4 IF WE TRUNCATED MESSAGE, 0 IF WE DIDNT
        LTR 15,15 CHECK RC FROM WTO
        BNZ RETURN 0 WTO RC RETURNED TO CALLER
        LR 15,7 TELL CALLER IF STRING WAS TOO LONG
RETURN DS 0H
        LR  15,9
        EDCEPIL
MSG     MVC BUFFER(*-*),0(6)
WTOL    WTO TEXT=,ROUTCDE=11,DESC=12,MF=L LIST FORM
WTOLEN EQU *-WTOL LENGTH TO MOVE
DSA EDCDSAD
            DS 0F
WTOD DS CL(WTOLEN)
PREFIX DS H
BUFFER DS CL126
DLEN EQU *-DSA
        END
